Tekla Open API Reference for Tekla Structures 2025
RadiusDimensionAttributes Class
 The RadiusDimensionAttributes class contains attributes to manage all the attributes of a straight dimension.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes
 Tekla.Structures.Drawing.RadiusDimensionAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RadiusDimensionAttributes : DimensionSetBaseAttributes
<SerializableAttribute>
Public Class RadiusDimensionAttributes
	Inherits DimensionSetBaseAttributes
The RadiusDimensionAttributes type exposes the following members.
Constructors
Name | Description
RadiusDimensionAttributes()
 Creates a new radius dimension attributes instance which loads standard attributes.
RadiusDimensionAttributes(String)
 Creates a new radius dimension attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Arrowhead
 The arrowhead attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Color
 The color of the dimension line.
 (Inherited from DimensionSetBaseAttributes.)
Format
 The format attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Placing
 The placing attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
Text
 The text attributes of the dimension.
 (Inherited from DimensionSetBaseAttributes.)
TransparentBackground
 The dimension text background transparency. (transparent/opaque)
 (Inherited from DimensionSetBaseAttributes.)
TrueColor
 The true color (RGB enabled) of the dimension line.
 (Inherited from DimensionSetBaseAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads attributes from the specified attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
Examples
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           RadiusDimensionAttributes attributes = new RadiusDimensionAttributes("MyAttributes");
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace